Revit 2024 API
ScheduleDefinition.InsertField Method
Overload List
Name | Description
InsertField(SchedulableField, Int32)
 Adds a regular field at the specified position in the list.
InsertField(ScheduleFieldType, Int32)
 Adds a regular field at the specified position in the list.
InsertField(ScheduleFieldType, ElementId, Int32)
 Adds a regular field at the specified position in the list.
See Also
ScheduleDefinition Class
ScheduleDefinition Members
Autodesk.Revit.DB Namespace